In [2]:
%%HTML

<h2>This is the excerices from <a href"https://www.oreilly.com/library/view/learning-sql-3rd/9781492057604/">Learn SQL book</a><h2>

In [2]:
import mysql.connector

cursor = None

# Creating connection object

def mysql_connect():
    mydb = mysql.connector.connect(
        host = "localhost",
        user = "sakila",
        password = "p_ssW0rd",
        database = "sakila"

    )

    cursor = mydb.cursor()
    
    return mydb, cursor
 
mydb, cursor= mysql_connect()

# Printing the connection object 
print(mydb)

<mysql.connector.connection_cext.CMySQLConnection object at 0x7f19bc64d590>

In [3]:
def sql_execute(query:str, display=True):
    mydb, cursor= mysql_connect()
    cursor.execute(query)
    if display:
        for x in cursor:
          print(x)

In [4]:
# Get the column names
def show_table_columns(table:str):
    query = "SHOW COLUMNS FROM {}".format(table)
    sql_execute(query)

In [5]:
# Testing Query
query = "select * from actor LIMIT 1"
sql_execute(query)

(1, 'PENELOPE', 'GUINESS', datetime.datetime(2006, 2, 15, 4, 34, 33))

In [6]:
%%HTML
<h3>Chapter 1 and 2 have no exercises<h3>

In [7]:
%%HTML
<h3>Chapter 3 exercises<h3>
<img src='images/chapter_3_exercises.png' width=800/>

In [8]:
# Exercise 3-1

query = "SELECT actor_id, first_name, last_name FROM actor ORDER BY last_name, first_name"
# or we can write this based on column order in the SELECT statement
query = "SELECT actor_id, first_name, last_name FROM actor ORDER BY 3, 2"

sql_execute(query)

(58, 'CHRISTIAN', 'AKROYD')
(182, 'DEBBIE', 'AKROYD')
(92, 'KIRSTEN', 'AKROYD')
(118, 'CUBA', 'ALLEN')
(145, 'KIM', 'ALLEN')
(194, 'MERYL', 'ALLEN')
(76, 'ANGELINA', 'ASTAIRE')
(112, 'RUSSELL', 'BACALL')
(190, 'AUDREY', 'BAILEY')
(67, 'JESSICA', 'BAILEY')
(115, 'HARRISON', 'BALE')
(187, 'RENEE', 'BALL')
(47, 'JULIA', 'BARRYMORE')
(158, 'VIVIEN', 'BASINGER')
(174, 'MICHAEL', 'BENING')
(124, 'SCARLETT', 'BENING')
(14, 'VIVIEN', 'BERGEN')
(121, 'LIZA', 'BERGMAN')
(91, 'CHRISTOPHER', 'BERRY')
(60, 'HENRY', 'BERRY')
(12, 'KARL', 'BERRY')
(189, 'CUBA', 'BIRCH')
(25, 'KEVIN', 'BLOOM')
(185, 'MICHAEL', 'BOLGER')
(37, 'VAL', 'BOLGER')
(98, 'CHRIS', 'BRIDGES')
(39, 'GOLDIE', 'BRODY')
(159, 'LAURA', 'BRODY')
(167, 'LAURENCE', 'BULLOCK')
(40, 'JOHNNY', 'CAGE')
(11, 'ZERO', 'CAGE')
(181, 'MATTHEW', 'CARREY')
(86, 'GREG', 'CHAPLIN')
(3, 'ED', 'CHASE')
(176, 'JON', 'CHASE')
(183, 'RUSSELL', 'CLOSE')
(16, 'FRED', 'COSTNER')
(129, 'DARYL', 'CRAWFORD')
(26, 'RIP', 'CRAWFORD')
(49, 'ANNE', 'CRONYN')
(104, 'PENELOPE', 'CRONYN')
(105, 'SIDNEY', 'CROWE')
(57, 'JUDE', 'CRUISE')
(80, 'RALPH', 'CRUZ')
(81, 'SCARLETT', 'DAMON')
(4, 'JENNIFER', 'DAVIS')
(110, 'SUSAN', 'DAVIS')
(101, 'SUSAN', 'DAVIS')
(48, 'FRANCES', 'DAY-LEWIS')
(35, 'JUDY', 'DEAN')
(143, 'RIVER', 'DEAN')
(148, 'EMILY', 'DEE')
(138, 'LUCILLE', 'DEE')
(107, 'GINA', 'DEGENERES')
(41, 'JODIE', 'DEGENERES')
(166, 'NICK', 'DEGENERES')
(89, 'CHARLIZE', 'DENCH')
(123, 'JULIANNE', 'DENCH')
(160, 'CHRIS', 'DEPP')
(100, 'SPENCER', 'DEPP')
(109, 'SYLVESTER', 'DERN')
(173, 'ALAN', 'DREYFUSS')
(36, 'BURT', 'DUKAKIS')
(188, 'ROCK', 'DUKAKIS')
(106, 'GROUCHO', 'DUNST')
(19, 'BOB', 'FAWCETT')
(199, 'JULIA', 'FAWCETT')
(10, 'CHRISTIAN', 'GABLE')
(165, 'AL', 'GARLAND')
(184, 'HUMPHREY', 'GARLAND')
(127, 'KEVIN', 'GARLAND')
(154, 'MERYL', 'GIBSON')
(46, 'PARKER', 'GOLDBERG')
(139, 'EWAN', 'GOODING')
(191, 'GREGORY', 'GOODING')
(71, 'ADAM', 'GRANT')
(179, 'ED', 'GUINESS')
(1, 'PENELOPE', 'GUINESS')
(90, 'SEAN', 'GUINESS')
(32, 'TIM', 'HACKMAN')
(175, 'WILLIAM', 'HACKMAN')
(152, 'BEN', 'HARRIS')
(141, 'CATE', 'HARRIS')
(56, 'DAN', 'HARRIS')
(97, 'MEG', 'HAWKE')
(151, 'GEOFFREY', 'HESTON')
(169, 'KENNETH', 'HOFFMAN')
(79, 'MAE', 'HOFFMAN')
(28, 'WOODY', 'HOFFMAN')
(161, 'HARVEY', 'HOPE')
(134, 'GENE', 'HOPKINS')
(113, 'MORGAN', 'HOPKINS')
(50, 'NATALIE', 'HOPKINS')
(132, 'ADAM', 'HOPPER')
(170, 'MENA', 'HOPPER')
(65, 'ANGELA', 'HUDSON')
(52, 'CARMEN', 'HUNT')
(140, 'WHOOPI', 'HURT')
(131, 'JANE', 'JACKMAN')
(119, 'WARREN', 'JACKMAN')
(146, 'ALBERT', 'JOHANSSON')
(8, 'MATTHEW', 'JOHANSSON')
(64, 'RAY', 'JOHANSSON')
(82, 'WOODY', 'JOLIE')
(43, 'KIRK', 'JOVOVICH')
(130, 'GRETA', 'KEITEL')
(198, 'MARY', 'KEITEL')
(74, 'MILLA', 'KEITEL')
(55, 'FAY', 'KILMER')
(153, 'MINNIE', 'KILMER')
(162, 'OPRAH', 'KILMER')
(45, 'REESE', 'KILMER')
(23, 'SANDRA', 'KILMER')
(103, 'MATTHEW', 'LEIGH')
(5, 'JOHNNY', 'LOLLOBRIGIDA')
(157, 'GRETA', 'MALDEN')
(136, 'ED', 'MANSFIELD')
(22, 'ELVIS', 'MARX')
(77, 'CARY', 'MCCONAUGHEY')
(70, 'MICHELLE', 'MCCONAUGHEY')
(114, 'MORGAN', 'MCDORMAND')
(177, 'GENE', 'MCKELLEN')
(38, 'TOM', 'MCKELLEN')
(128, 'CATE', 'MCQUEEN')
(27, 'JULIA', 'MCQUEEN')
(42, 'TOM', 'MIRANDA')
(178, 'LISA', 'MONROE')
(120, 'PENELOPE', 'MONROE')
(7, 'GRACE', 'MOSTEL')
(99, 'JIM', 'MOSTEL')
(61, 'CHRISTIAN', 'NEESON')
(62, 'JAYNE', 'NEESON')
(6, 'BETTE', 'NICHOLSON')
(125, 'ALBERT', 'NOLTE')
(150, 'JAYNE', 'NOLTE')
(122, 'SALMA', 'NOLTE')
(108, 'WARREN', 'NOLTE')
(34, 'AUDREY', 'OLIVIER')
(15, 'CUBA', 'OLIVIER')
(69, 'KENNETH', 'PALTROW')
(21, 'KIRSTEN', 'PALTROW')
(33, 'MILLA', 'PECK')
(30, 'SANDRA', 'PECK')
(87, 'SPENCER', 'PECK')
(73, 'GARY', 'PENN')
(133, 'RICHARD', 'PENN')
(88, 'KENNETH', 'PESCI')
(171, 'OLYMPIA', 'PFEIFFER')
(51, 'GARY', 'PHOENIX')
(54, 'PENELOPE', 'PINKETT')
(84, 'JAMES', 'PITT')
(75, 'BURT', 'POSEY')
(93, 'ELLEN', 'PRESLEY')
(135, 'RITA', 'REYNOLDS')
(142, 'JADA', 'RYDER')
(195, 'JAYNE', 'SILVERSTONE')
(180, 'JEFF', 'SILVERSTONE')
(78, 'GROUCHO', 'SINATRA')
(31, 'SISSY', 'SOBIESKI')
(44, 'NICK', 'STALLONE')
(24, 'CAMERON', 'STREEP')
(116, 'DAN', 'STREEP')
(192, 'JOHN', 'SUVARI')
(9, 'JOE', 'SWANK')
(155, 'IAN', 'TANDY')
(66, 'MARY', 'TANDY')
(59, 'DUSTIN', 'TAUTOU')
(193, 'BURT', 'TEMPLE')
(53, 'MENA', 'TEMPLE')
(149, 'RUSSELL', 'TEMPLE')
(200, 'THORA', 'TEMPLE')
(126, 'FRANCES', 'TOMEI')
(18, 'DAN', 'TORN')
(94, 'KENNETH', 'TORN')
(102, 'WALTER', 'TORN')
(20, 'LUCILLE', 'TRACY')
(117, 'RENEE', 'TRACY')
(17, 'HELEN', 'VOIGHT')
(95, 'DARYL', 'WAHLBERG')
(2, 'NICK', 'WAHLBERG')
(196, 'BELA', 'WALKEN')
(29, 'ALEC', 'WAYNE')
(163, 'CHRISTOPHER', 'WEST')
(197, 'REESE', 'WEST')
(172, 'GROUCHO', 'WILLIAMS')
(137, 'MORGAN', 'WILLIAMS')
(72, 'SEAN', 'WILLIAMS')
(83, 'BEN', 'WILLIS')
(96, 'GENE', 'WILLIS')
(164, 'HUMPHREY', 'WILLIS')
(168, 'WILL', 'WILSON')
(147, 'FAY', 'WINSLET')
(68, 'RIP', 'WINSLET')
(144, 'ANGELA', 'WITHERSPOON')
(156, 'FAY', 'WOOD')
(13, 'UMA', 'WOOD')
(63, 'CAMERON', 'WRAY')
(111, 'CAMERON', 'ZELLWEGER')
(186, 'JULIA', 'ZELLWEGER')
(85, 'MINNIE', 'ZELLWEGER')

In [9]:
# Exercise 3-2

query = "SELECT actor_id, first_name, last_name FROM actor WHERE last_name='WILLIAMS' OR last_name='DAVIS'"
sql_execute(query)

(4, 'JENNIFER', 'DAVIS')
(101, 'SUSAN', 'DAVIS')
(110, 'SUSAN', 'DAVIS')
(72, 'SEAN', 'WILLIAMS')
(137, 'MORGAN', 'WILLIAMS')
(172, 'GROUCHO', 'WILLIAMS')

In [10]:
# Exercise 3-3
#show_table_columns('rental')
query = "SELECT DISTINCT customer_id FROM rental WHERE DATE(rental_date)='2005-07-05'"
sql_execute(query)

(8,)
(37,)
(60,)
(111,)
(114,)
(138,)
(142,)
(169,)
(242,)
(295,)
(296,)
(298,)
(322,)
(348,)
(349,)
(369,)
(382,)
(397,)
(421,)
(476,)
(490,)
(520,)
(536,)
(553,)
(565,)
(586,)
(594,)

In [11]:
%%HTML
<h3>Chapter 4 exercises<h3>
<img src='images/chapter_4_exercises.png' width=800/>

In [20]:
# Exercise 4-3
#show_table_columns('payment')

# Using OR

query = "SELECT amount FROM payment WHERE amount=1.98 OR amount=7.98 OR amount=9.98"
sql_execute(query)

# Using IN - This is cleaner than OR statement

query = "SELECT amount FROM payment WHERE amount IN (1.98,7.98,9.98)"
sql_execute(query)

(Decimal('7.98'),)
(Decimal('9.98'),)
(Decimal('1.98'),)
(Decimal('7.98'),)
(Decimal('7.98'),)
(Decimal('7.98'),)
(Decimal('7.98'),)
(Decimal('7.98'),)
(Decimal('9.98'),)
(Decimal('1.98'),)
(Decimal('7.98'),)
(Decimal('7.98'),)
(Decimal('7.98'),)
(Decimal('7.98'),)

In [25]:
# Exercise 4-4
#show_table_columns('customer')
query = "SELECT first_name, last_name FROM customer WHERE last_name LIKE '_A%W%' ORDER BY last_name;"
sql_execute(query)

('KAY', 'CALDWELL')
('JOHN', 'FARNSWORTH')
('JILL', 'HAWKINS')
('LEE', 'HAWKS')
('LAURIE', 'LAWRENCE')
('JEANNE', 'LAWSON')
('LAWRENCE', 'LAWTON')
('SAMUEL', 'MARLOW')
('ERICA', 'MATTHEWS')

In [28]:
%%HTML
<h3>Chapter 5 exercises</h3>
<br/>
1. Write a query that returns the title of every film in which an actor with first name JOHN appeared.
<br/>
2. Construct a Query that returns all addresses that are in the same city. you will need to join the address table to itself, and each row should include two diffeent addresses.
<br/>

In [52]:
# Exercise 5-1
#sql_execute("SHOW TABLES;")
#show_table_columns('film')
#show_table_columns('actor')
#show_table_columns('film_actor')

# Solution is implemented using multiple joins
query = "SELECT f.title FROM film f INNER JOIN film_actor fa  ON f.film_id=fa.film_id INNER JOIN actor a ON fa.actor_id=a.actor_id WHERE a.first_name='JOHN'"
sql_execute(query)

('ALLEY EVOLUTION',)
('BEVERLY OUTLAW',)
('CANDLES GRAPES',)
('CLEOPATRA DEVIL',)
('COLOR PHILADELPHIA',)
('CONQUERER NUTS',)
('DAUGHTER MADIGAN',)
('GLEAMING JAWBREAKER',)
('GOLDMINE TYCOON',)
('HOME PITY',)
('INTERVIEW LIAISONS',)
('ISHTAR ROCKETEER',)
('JAPANESE RUN',)
('JERSEY SASSY',)
('LUKE MUMMY',)
('MILLION ACE',)
('MONSTER SPARTACUS',)
('NAME DETECTIVE',)
('NECKLACE OUTBREAK',)
('NEWSIES STORY',)
('PET HAUNTING',)
('PIANIST OUTFIELD',)
('PINOCCHIO SIMON',)
('PITTSBURGH HUNCHBACK',)
('QUILLS BULL',)
('RAGING AIRPLANE',)
('ROXANNE REBEL',)
('SATISFACTION CONFIDENTIAL',)
('SONG HEDWIG',)

In [62]:
# Exercise 5-2
# Construct a Query that returns all addresses that are in the same city. 
# you will need to join the address table to itself, and each row should include two diffeent addresses.
#sql_execute("SHOW TABLES;")
#show_table_columns('address')
#show_table_columns('city')
query = "SELECT a1.address, a2.address, a1.city_id  FROM address a1 INNER JOIN address a2 ON a1.city_id = a2.city_id AND a1.address < a2.address"
sql_execute(query)

('23 Workhaven Lane', '47 MySakila Drive', 300)
('1411 Lillydale Drive', '28 MySQL Boulevard', 576)
('1497 Yuzhou Drive', '548 Uruapan Street', 312)
('43 Vilnius Manor', '587 Benguela Manor', 42)